# TextTreatment Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ACADExportOptions..::..TextTreatment Property
ACADExportOptions Class See Also
---
The text treatment. Deault value is TextTreatment.Exact.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public TextTreatment TextTreatment { get; set; }
```

Visual Basic
---
```text
Public Property TextTreatment As TextTreatment
	Get
	Set
```

Visual C++
---
```text
public:
property TextTreatment TextTreatment {
	TextTreatment get ();
	void set (TextTreatment value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
ACADExportOptions Class
Autodesk.Revit.DB Namespace